'use strict'

//  1. - присвоить каждому из следующих значений свою переменную: 'hello','owu','com', 'ua', 1, 10, -999, 123,
//  3.14, 2.7, 16, true, false Вывести каждую при помощи console.log , alert, document.write

let hello = 'hello';
let owu = 'owu';
let com = 'com';
let ua = 'ua';
let a = 1;
let b = 10;
let c = -999;
let d = 123;
let pi = 3.14;
let e = 2.7;
let f = 16;
let boolA = true;
let boolB = false;

// Выводить вот так:
console.log(hello);
// alert(hello);
document.write(hello + " ");

// Для ленивых (типо меня)
let arrVar = [hello, owu, com, ua, a, b, c, d, pi, e, f, boolA, boolB];

printVars(arrVar);

function printVars(a) {
    for (let i = 0; i < a.length; i++) {
        console.log(a[i]);
        // alert(a[i]);
        document.write(a[i] + " ");
    }
}

//==================================================================================================================

//    2. - переопределить каждую переменную из задания 1 дав им произвольные значения Вывести каждую
//    при помощи console.log , alert, document.write

hello = 400;
owu = 13;
com = 13.43;
ua = true;
a = false;
b = 'slon';
c = 'ce';
d = 'de';
pi = 'soon'; //oops=)))
e = 24;
f = 'fialka';
boolA = 1000000;
boolB = 'million';

arrVar = [hello, owu, com, ua, a, b, c, d, pi, e, f, boolA, boolB];

printVars(arrVar);

//==================================================================================================================

//      3. Создать 3 числовых и 3 стринговых константы. Вывести каждую при помощи
//      console.log , alert, document.write
{
    const a = 20;
    const b = 30;
    const c = 40;
    const d = 'dron';
    const e = 'koliba';
    const f = 'karantin';

    let arrConst = [a, b, c, d, e, f];

    printVars(arrConst);
}

//==================================================================================================================

//      4. - при помощи 3х разных prompt() получить 3 слова которые являются вашими ФИО. Для фамилии имени и отчества
//      создать разные переменные. Вывести каждую при помощи console.log , alert, document.write

let LastName = prompt('Введіть прізвище'),
    Name = prompt('Ім\'я'),
    PoBatkovi = prompt('По батькові');

let arrFIO = [LastName, Name, PoBatkovi];

printVars(arrFIO);

//=================================================================================================================

//      5. - Взять переменные из задания 4 и сконкатенировать их в одной переменной person.

let person = LastName + ' ' + Name + ' ' + PoBatkovi;

//=================================================================================================================

//      6. - Взять задние 4 и 5 и применить его к ФИО всех членов своей семьи.

function familyNames(who) {
    let lastName = prompt('Введіть прізвище ' + who),
        name = prompt('Ім\'я ' + who),
        poBatkovi = prompt('По батькові ' + who);

    return `${lastName} ${name} ${poBatkovi}`;
}

{
    let mother = familyNames('мами');
    let father = familyNames('папи');
    let sister = familyNames('сестри');
    let dog = familyNames('собаки');
}

// let arrFamilyNames = [mother, father, sister, dog];
// printVars(arrFamilyNames);

//=================================================================================================================

//      7. - при помощи prompt() получить 3 числа. Привести их к числовому типу при помощи +.
//      вывести их в консоль.

{
    let a = +prompt('your number');
    let b = +prompt('your number');
    let c = +prompt('your number');

    console.log(a);
    console.log(b);
    console.log(c);
}

//=================================================================================================================

//      8. - при помощи prompt() получить 4 числа. Привести их к числовому типу при помощи parseInt.
//      Сложить их между собой записав результат в переменную result и вывести в консоль браузера

let result = 0;
for (let i = 0; i < 4; i++) {
    let num = prompt('enter number');
    let parseNum = parseInt(num);
    result += parseNum;
}
console.log(result);

//=================================================================================================================

//      9. - при помощи prompt()  получить 3 числа с плавающей точекой. при помощи parseFloat привести их
//      к соответсвующему типу.
//      Сложить их между собой записав результат в переменную result и вывести в консоль браузера

{
    let result = 0;
    for (let i = 0; i < 3; i++) {
        result += parseFloat(prompt('enter float number')); // ну или так....
    }
    console.log(result);
}

//================================================================================================================

//      10. - при помощи prompt()  получить 3 числа с плавающей точекой.
//      Округлить их при помощи Math.round Сложить их между собой записав результат в переменную  и вывести в консоль браузера
{
    let result = 0;
    for (let i = 0; i < 3; i++) {
        let num = parseFloat(prompt('enter float number'));
        result += Math.round(num);
    }
    console.log(result);
}


//================================================================================================================

//      11. - при помощи prompt()  получить 2 целых числа. Привести их к целочисленному типу.
//      Первое число - это число которое будут возводить в степень. Второе число - это число которое является степенью.
//      При помощи Math.pow возвести первое число в степень второго числа.
{
    let num = parseInt(prompt('enter float number'));
    let pow = parseInt(prompt('enter float number'));
    let result = Math.pow(num, pow);
}


// console.log(result);

//=================================================================================================================

//      12. - При помощи оператора опредеоения типа typeof определить типы следующих переменных
//      и вывести их в консоль let a = 100; let b = '100'; let c = true; let d = undefined;
{
    let a = 100;
    let b = '100';
    let c = true;
    let d = undefined;

    console.log(typeof a);
    console.log(typeof b);
    console.log(typeof c);
    console.log(typeof d);
}

//=================================================================================================================

//      13. - Поставьте соответствующий оператор в выражениях что бы получился соответсвующий результат.
//      В одинаковых выражениях в задании не использовать два одинаковых оператора.
//      Каждое выражение вложить в свою переменную

{
    let a = (5 < 6); //-> true
    let b = (5 > 6); //-> false
    let c = (5 == 6); //-> false
    let d = (5 >= 6); //-> false
    let e = (10 >= 10); //-> true
    let f = (10 === 10); //-> true
    let g = (10 != 10); //-> false
    let h = (10 > 10); //-> false
    let i = !!(10 - 10); //-> false
    let j = (123 === '123'); //-> false
    let k = (123 == '123'); //-> true
}

//=================================================================================================================

//      14. - Посмотрев на следюующие выражения, скажите, каков будет вывод в консоль

// console.log(132 > 100 && 45 < 12 );          // false
// console.log(34 > 33 && 23 < 90 );            // true
// console.log(99 > 100 && 45 > 12 );           // false
// console.log(132 > 100 || 45 < 12 );          // true
// console.log(111 > 11 || 45 < 111 );          // true
// console.log((111 > 11 || 45 < 111) && (132 > 100 || 45 < 12) );      // true
// console.log((111 > 11 || 45 < 56) || (132 > 100 || 45 < 12) );       // true
// console.log((132 > 100 && 45 < 12 ) && (132 > 100 || 45 < 12 ) );    // false
// console.log((111 > 11 || 45 < 111) || (99 > 100 && 45 > 12 ));       // true
// console.log(!!'-1');             // true
// console.log(!!-1);               // true
// console.log(!!'0');              // true
// console.log(!!'null');           // true
// console.log(!!'undefined');      // true
// console.log(!!(3/'owu'));        // true
// console.log((111 > 11 || 45 < 111) ||  !!'0');       // true
// console.log((!!111 == !!11 || 45 < 111) && (99 > 100 && 45 > 12 ));      // false


//==========================================!!!---CLASS---!!!==================================================================

//      15. 1.Определите переменные str, num, flag и txt со значениями «Привет», 123, true, «true».
//   При помощи оператора typeof убедитесь, что значения переменных принадлежат типам: string, number и  boolean.
{
    let str = 'Привет',
        num = 123,
        flag = true,
        txt = 'true';

    let arrTypes = [str, num, flag, txt];

    for (let i = 0; i < arrTypes.length; i++) {
        switch (typeof arrTypes[i]) {
            case "number":
                console.log(`${arrTypes[i]} is number!`);
                break;
            case "string":
                console.log(`${arrTypes[i]} is string!`);
                break;
            case "boolean":
                console.log(`${arrTypes[i]} is boolean!`);
                break;
        }
    }
}

//===================================================================================================================

//      16. 2. Создайте переменные a1, a2, a3, a4, a5. При помощи математических операторов (сложение, вычитание и т.д.)
//      найдите значения выражений:
//      поместив результат каждого выражения в соответствующую переменную. Например, let a1 = 5 + 3.

let a1 = 5 + 3,
    a2 = 5 - 3,
    a3 = 5 * 3,
    a4 = 5 / 3,
    a5 = 5 % 3,

//====================================================================================================================

//      17. 3.  Создайте переменные a6, a7, a8, a9, a10. Поместите в них результат выражений:

    a6 = 5 % 3,
    a7 = 3 % 5,
    a8 = 5 + '3',
    a9 = '5' - 3,
    a10 = 75 + 'кг';

//=================================================================================================================

//      18. 4. Напишите код, который находит площадь прямоугольника высота 23см. ( переменная height),
//       шириной 10см (переменная width), значение площади должно хранится в числовой переменной s.

let height = '23см',
    width = '10см';

let s = (parseInt(height) * parseInt(width)) + 'см';

//=================================================================================================================

//      19. 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//      результат поместите в переменную v.

let heightC = '10м',
    dC = '4м';

let v = (Math.pow((Math.PI * parseInt(dC)), 2) * parseInt(heightC)) + 'м<sup>3</sup>';

//=================================================================================================================

//      20. 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
//   Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень)
//   или оператор возведения в степень ** ).

let n = 3,
    m = 4;

let k = Math.sqrt((n ** 2) + (m ** 2));

//=================================================================================================================

//      21. 7. Напишите скрипт, который выводит "Hello world", создавши переменную str
//      и выводить спомощью document.write, alert и console.log

let str = "Hello world";

console.log(str);
// alert(str);
document.write(str);

//==================================================================================================================

//      22. 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст,
//      хобби (каждой на новой строки спомощью \n).

// alert(
//     'ФИО: Махно Нестор Иванович\nВозраст: 35 годиков\nХобби: Покушать'
// );

//=================================================================================================================

//      23. 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//      Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//      Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//      Вывести в документ содержимое переменной concatenation спомощью document.write

let str1 = 'Кто ',
    str2 = 'ты ',
    str3 = 'такой?',
    concatenation = str1 + str2 + str3;

document.write(concatenation);

//=================================================================================================================

//      24. 10. Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//     let str = "20";
//      let a = 5;
//      document.write(str + a + "<br/>");          // 205 - строка + число = строка
//      document.write(str - a + "<br/>");          // 15    - если я правильно понимаю, то тут у нас преобразование
//      document.write(str * "2" + "<br/>");        // 40    - в число если это возможно иначе было бы NaN, так как не
//      document.write(str / 2 + "<br/>");          // 10    - получилось бы неявно преобразовать...ну както так я это понимаю...

//=================================================================================================================

//      25. 11. Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
//     parseInt("3.14")         // 3
//     parseInt("-7.875")       // -7
//     parseInt("435")          // 435
//     parseInt("Вася")         // NaN

//==================================================================================================================

//      26. 12.  С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные,
//      которые будут использоваться далее, повторите код ниже
//     let str = prompt("Enter something", "ho-ho")
//     console.log(str);

//==================================================================================================================

//      27. 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел,
//      а вывод результата при помощи метода alert

// let num1 = prompt('enter number1'),
//     num2 = prompt('enter number2');
//
// alert(num1 + num2);

//===================================================================================================================

//      28. 14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя,
//      фамилию и возраст, а вам не обходимо вывести строку такого вида
//       Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert

// {
//     let name = prompt('Введите ваше имя: '),
//         surname = prompt('Введите вашу фамилию: '),
//         age = prompt('Введите ваш возраст: ');
//
//     let str = `Добрый вечер, ${name} ${surname}, мои поздравления, что ваи ${age}!`;
//
//     alert(str);
// }

//==================================================================================================================
//                                                    ======ДОП============
//==================================================================================================================

//      29. 1. Три різних числа вводяться через prompt().
//          За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
{
    let a = +prompt("num1"),
        b = +prompt("num2"),
        c = +prompt("num3");

    let min = 0,
        med = 0,
        max = 0;

    if (a < b && a < c) {
        min = a;
    } else if (b < a && b < c) {
        min = b;
    } else if (c < b && c < a) {
        min = c;
    }

    if (a > b && a > c) {
        max = a;
    } else if (b > a && b > c) {
        max = b;
    } else if (c > b && c > a) {
        max = c;
    }

    if (a !== min && a !== max) {
        med = a;
    } else if (b !== min && b !== max) {
        med = b;
    } else if (c !== min && c !== max) {
        med = c;
    }

    console.log(min, med, max);
}

//=====================================================================================================================

//      30. 2.
// Все параматры получаем с клавиатуры!!!!
// Имитируем поведение пешехода на перекстке.
// Если светофор зеленый - вывести "иди".
// Если светофор желтый - вывести "подожди".
// Если светофор красный - вывести "стой".
// Если светофор в аварийном режиме вывести "делай что хочешь"!

{
    let color = prompt("enter color");

    switch (color) {
        case 'green':
            console.log('иди');
            break;
        case 'yellow':
            console.log('подожди');
            break;
        case 'red':
            console.log('стой');
            break;
        default:
            console.log('делай что хочешь');
    }
}

//===================================================================================================================

//      31. 3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
// Улучшаем предыдущее задание.
// Если светофор зеленый и машин нет - вывести "иди".
// Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
// Если светофор желтый и машин нет - вывести "все рано жди".
// Если светофор красный и машин нет- вывести "стой все рано".
// Если светофор красный - и машины есть вывести "стой и жди".
// Если светофор в аварийном режиме вывести "делай что хочешь"!
{
    let color = prompt("enter color");
    let isRoadClear = confirm('Is road clear?');
    switch (color) {
        case 'green':
            if(isRoadClear) {
                console.log('иди');
            }else{
                console.log('подожди пока нарушители проедут');
            }
            break;
        case 'yellow':
            if(!isRoadClear) {
                console.log('жди');
            }else{
                console.log('все рано жди');
            }
            break;
        case 'red':
            if(isRoadClear) {
                console.log('стой еще рано');
            }else{
                console.log('стой и жди');
            }
            break;
        default:
            console.log('делай что хочешь');
    }
}

//====================================================================================================================